r00n4/docs_source/ARM/Milandr/Eval_1968BE92Q/MDR1986BExx_prj_exaples/1.5.3/MDR1986BEx.pdsc
            Memory:
             - 128 KBytes of Flash memory (ISP and IAP)
             - 32 KBytes of SRAM

            Supply and Clock rate:
             - internal regulator for core voltage supply
             - built-in power control system
             - internal battery domain
             - internal 8 MHz RC clock generator with calibration
             - internal 40 kHz RC clockgenerator with calibration
             - external oscillator 2 .. 16 MHz
             - external oscillator 32 KHz
             - on-board PLL for clock frequency
             - dedicated PLL for USB clock frequency

            Low power consumption modes:
             - Sleep, Stop and Standby
             - battery domain with RTC and backup registers

            Analog features:
             - 12-bit ADC (5 channels)
             - conversion range: 0 to 3.6 V
             - temperature sensor
             - 12-bit DAC
             - internal comparator

            Peripheral features:
             - DMA controller (32 channel)
             - USB 2.0 full-speed OTG controller (Device and Host)
             - 3 Synch. 16-bit Timers (Input Capture, Output Compare, PWM)
             - 2 * CAN interface (2.0B)
             - 2 * UART
             - 2 * SPI
             - 1 * I2C
             - 31 GPIO pins

            Debug mode:
             - JTAG and SWD
          </description>
        </device>
      </subFamily>
      <subFamily DsubFamily="Cortex-M1">
        <!-- MDR1986BE1T -->
        <device Dname="MDR1986BE1T">
          <processor Dcore="Cortex-M1" DcoreVersion="r1p0" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="144000000"/>
          <compile header="Libraries/CMSIS/CM1/DeviceSupport/MDR1986VE1T/inc/MDR1986VE1T.h" define="USE_MDR1986VE1T"/>
          <debug      svd="IDE/keil/SVD/MDR1986VE1T.svd"/>
          <memory     id="IROM1"                          start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                          start="0x20100000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/1986BE1T.FLM"           start="0x00000000"  size="0x20000" RAMstart="0x20100000" RAMsize="0x4000" default="1"/>
          <description>
            (1986BE1T RUS)
            Core:
             - 32-bit ARM Cortex-M1 processor, running at frequencies of up to 140 MHz
             - 0.8 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
             - memory Protection Unit (MPU)
             - 24-bit SysTick Timer

            Memory:
             - 128 KBytes of Flash memory (ISP and IAP)
             - 48 KBytes of SRAM
             - external system bus controller (support of SRAM, ROM and NAND Flash)

            Supply and Clock rate:
             - internal regulator for core voltage supply
             - built-in power control system
             - internal battery domain
             - internal 8 MHz RC clock generator with calibration
             - internal 40 kHz RC clockgenerator with calibration
             - external oscillator 2 .. 16 MHz
             - external oscillator 20 ... 30 MHz
             - external oscillator 32 KHz
             - on-board PLL for clock frequency
             - dedicated PLL for USB clock frequency

            Low power consumption modes:
             - Sleep, Stop and Standby
             - battery domain with RTC and backup registers

            Analog features:
             - 2 * 12-bit ADC (16 channels)
             - conversion range: 0 to 3.6 V
             - temperature sensor
             - 12-bit DAC

            Peripheral features:
             - DMA controller (32 channel)
             - USB 2.0 full-speed OTG controller (Device and Host)
             - 3 Synch. 16-bit Timers (Input Capture, Output Compare, PWM)
             - 2 * CAN interface (2.0B)
             - 2 * UART
             - 2 * SPI
             - Digital interface controller according to GOST 18977-79
             - Two digital interface controller according to GOST R 52070-2003
             - Digital Controller Ethernet 10/100 PHY Transceiver
             - 96 GPIO pins

            Debug mode:
             - JTAG and SWD
          </description>
        </device>
        
        <!-- MDR1986BE3T -->
        <device Dname="MDR1986BE3T">
          <processor Dcore="Cortex-M1" DcoreVersion="r1p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Libraries/CMSIS/CM1/DeviceSupport/MDR1986VE3/inc/MDR1986VE3.h" define="USE_MDR1986VE3"/>
          <debug      svd="IDE/keil/SVD/MDR1986VE3T.svd"/>
          <memory     id="IROM1"                          start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                          start="0x20100000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/1986BE3T.FLM"           start="0x00000000"  size="0x20000" RAMstart="0x20100000" RAMsize="0x4000" default="1"/>
          <description>
                        (1986BE3T RUS)
            Core:
             - 32-bit ARM Cortex-M1 processor, running at frequencies of up to 140 MHz
             - 0.8 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
             - memory Protection Unit (MPU)
             - 24-bit SysTick Timer

            Memory:
             - 128 KBytes of Flash memory (ISP and IAP)
             - 48 KBytes of SRAM
             - external system bus controller (support of SRAM, ROM and NAND Flash)

            Supply and Clock rate:
             - internal regulator for core voltage supply
             - built-in power control system
             - internal battery domain
             - internal 8 MHz RC clock generator with calibration
             - internal 40 kHz RC clockgenerator with calibration
             - external oscillator 2 .. 16 MHz
             - external oscillator 20 ... 30 MHz
             - external oscillator 32 KHz
             - on-board PLL for clock frequency
             - dedicated PLL for USB clock frequency

            Low power consumption modes:
             - Sleep, Stop and Standby
             - battery domain with RTC and backup registers

            Analog features:
            - 12-bit ADC (up to 8 channels) with the amplitude of the measured signals from 0 to 3.6 V 
            - Dual-channel 12-bit DAC 
            - 32-bit PWM (up to 8 channels) 
            - Single channel bit delta/sigma  ADC bit 16-bit output reports
            - Single channel bit elta/sigma DAC with 16-bit input reports
            - Temperature sensor

            Peripheral features:
            - Controller direct memory access functions for communicating Peripherals-Memory, Memory, Memory
            - Two CAN controller interface 
            - Digital interface controller according to GOST 18977-79 
            - Two digital interface controller according to GOST R52070-2003 
            - Two digital controller Ethernet 10/100 PHY Transceiver 
            - USB interface controller with functions of Device and Host 
            - Interface controllers 4hUART, 4hSPI 
            - Controller AudioCodec - Up to 144 user I / O lines

            Debug mode:
             - JTAG and SWD
          </description>
        </device>
      </subFamily>
      <subFamily DsubFamily="Cortex-M0">         
        <!-- MDR1986BE4 -->
        <device Dname="MDR1986BE4">
          <processor  Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="36000000"/>
          <compile    header="Libraries/CMSIS/CM0/DeviceSupport/MDR1986BE4/inc/MDR1986BE4.h" define="USE_MDR1986BE4"/>
          <debug      svd="IDE/keil/SVD/MDR1986VE4.svd"/>
          <memory     id="IROM1"                          start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/1986BE4.FLM"            start="0x00000000"  size="0x20000"    RAMstart="0x20000000" RAMsize="0x4000" default="1"/>
          <description>
            (MDR1986BE4 RUS)
              Core:
              - 32-bit ARM Cortex-M0 processor, running at frequencies of up to 36 MHz
              - 1.25 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
              - memory Protection Unit (MPU)
              - 24-bit SysTick Timer
              Memory:
              - 128 KBytes of Flash memory (ISP and IAP)
              - 16 KBytes of SRAM

              Supply and Clock rate:
              - internal regulator for core voltage supply
              - built-in power control system
              - internal battery domain
              - internal 8 MHz RC clock generator with calibration
              - internal 40 kHz RC clockgenerator with calibration
              - external oscillator 2 .. 16 MHz
              - external oscillator 32 KHz
              - on-board PLL for clock frequency
              - dedicated PLL for USB clock frequency

              Low power consumption modes:
              - Sleep, Stop and Standby
              - battery domain with RTC and backup registers

              Analog features:
              - 12-bit ADC (8 channels)
              - 24-bit ??ADC (8 channels)
              - conversion range: 0 to 3.6 V
              - temperature sensor
              - 12-bit DAC
              - internal comparator

              Peripheral features:
              - DMA controller (32 channel)
              - 2 Synch. 16-bit Timers (Input Capture, Output Compare, PWM)
              - 2 * UART
              - 1 * SPI
              - 40 GPIO pins

              Debug mode:
               - 1 SWD
          </description>
        </device>
      </subFamily>
      <!--   RISC and DSP CORE           -->
      <subFamily DsubFamily="Cortex-M3 with DSP">
        <!-- MDR1901VC1 -->
        <device Dname="MDR1901VC1">
          <processor Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="100000000"/>
          <compile    header="Libraries/CMSIS/CM3/DeviceSupport/MDR1901VC1T/inc/MDR1901VC1T.h" define="USE_MDR1901VC1T"/>
          <debug      svd="IDE/keil/SVD/MDR1986VE91.svd"/>
          <memory     id="IROM1"                          start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/1986BE9x.FLM"           start="0x08000000"  size="0x20000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>

          <description>
            (11901VC1 RUS)
            Core:
             - 32-bit ARM Cortex-M3 processor, running at frequencies of up to 100 MHz
             - 1.25 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
             - memory Protection Unit (MPU)
             - 24-bit SysTick Timer
            DSP Core:
             - TMS320C54 16-bit DSP Core analog, 100MHz
             - 128 KBytes Data RAM
             - 128 KBytes Program RAM

