r00n4/docs_source/ARM/Milandr/Eval_1968BE92Q/MDR1986BExx_prj_exaples/1.5.3/MDR1986BEx.pdsc
            Memory:
             - 128 KBytes of Flash memory (ISP and IAP)
             - 32 KBytes of SRAM
             - external system bus controller (support of SRAM, ROM and NAND Flash)

            Supply and Clock rate:
             - internal regulator for core voltage supply
             - built-in power control system
             - internal battery domain
             - internal 8 MHz RC clock generator with calibration
             - internal 40 kHz RC clockgenerator with calibration
             - external oscillator 2 .. 16 MHz
             - external oscillator 32 KHz
             - on-board PLL for clock frequency
             - dedicated PLL for USB clock frequency

            Low power consumption modes:
             - Sleep, Stop and Standby
             - battery domain with RTC and backup registers

            Analog features:
             - 2 * 12-bit ADC (16 channels)
             - conversion range: 0 to 3.6 V
             - temperature sensor
             - 1 * 12-bit DAC
             - internal comparator

            Peripheral features:
             - DMA controller (32 channel)
             - USB 2.0 full-speed OTG controller (Device and Host)
             - 3 Synch. 16-bit Timers (Input Capture, Output Compare, PWM)
             - 2 * CAN interface (2.0B)
             - 3 * UART
             - 2 * SPI
             - 1 * I2C
             - 96 GPIO pins

            Debug mode:
             - 2 * JTAG and SWD
          </description>
        </device> 
      </subFamily>       

    </family>
  </devices>
  
 <conditions> 
   <condition id="CON_MDR1901VC1">
    <description>MDR1986BExx device</description>
    <accept Dname="MDR1901VC1"/>
  </condition>
  <condition id="CON_MDR1986BE9x">
    <description>MDR1986BExx device</description>
    <accept Dname="MDR1986BE91"/>
    <accept Dname="MDR1986BE92"/>
    <accept Dname="MDR1986BE93"/>
  </condition>
  <condition id="CON_MDR1986BE9x_VC1">
    <description>MDR1986BExx device</description>
    <accept Dname="MDR1986BE91"/>
    <accept Dname="MDR1986BE92"/>
    <accept Dname="MDR1986BE93"/>
    <accept Dname="MDR1901VC1"/>
  </condition>  
  <condition id="CON_MDR1986BE1T">
    <description>MDR1986BE1T device</description>
    <accept Dname="MDR1986BE1T"/>
  </condition>
  <condition id="CON_MDR1986BE3T">
    <description>MDR1986BE1T device</description>
    <accept Dname="MDR1986BE3T"/>
  </condition>
  <condition id="CON_MDR1986BXX">
    <description>MDR1986BEXX device</description>
    <accept Dname="MDR1986BE91"/>
    <accept Dname="MDR1986BE92"/>
    <accept Dname="MDR1986BE93"/>
    <accept Dname="MDR1986BE1T"/>
    <accept Dname="MDR1986BE3T"/>
    <accept Dname="MDR1901VC1"/>
  </condition>
    <condition id="CON_MDR1986BEXT">
    <description>MDR1986BEXT device</description>
    <accept Dname="MDR1986BE1T"/>
    <accept Dname="MDR1986BE3T"/>
  </condition>  
  <condition id="CON_MDR1986BE4">
    <description>MDR1986BE1T device</description>
    <accept Dname="MDR1986BE4"/>
  </condition>
</conditions>
    
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.5" condition="CON_MDR1986BE9x">
      <description>System Startup for MDR1986BE9x device series</description>
      <files>
        <!-- startup files -->
        <file category="source" name="Libraries/CMSIS/CM3/DeviceSupport/MDR32F9Qx/startup/arm/startup_MDR32F9Qx.s" attr="config"/>
        <!-- system file -->      
        <file category="source" name="Libraries/CMSIS/CM3/DeviceSupport/MDR32F9Qx/startup/arm/system_MDR32F9Qx.c" attr="config"/>
        <!-- header file-->
        <file category="header" name="Libraries/CMSIS/CM3/DeviceSupport/MDR32F9Qx/startup/arm/system_MDR32F9Qx.h" attr="config"/>
        <!-- header file-->
        <file category="header" name="Libraries/CMSIS/CM3/CoreSupport/core_cm3.h"/>
        <!-- header file-->
        <file category="header" name="Config/MDR32F9Qx_config.h" attr="config"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.5" condition="CON_MDR1901VC1">
      <description>System Startup for MDR1901VC1 device series</description>
      <files>
        <!-- startup files -->
        <file category="source" name="Libraries/CMSIS/CM3/DeviceSupport/MDR1901VC1T/startup/arm/startup_MDR1901VC1T.s" attr="config"/>
        <!-- system file -->      
        <file category="source" name="Libraries/CMSIS/CM3/DeviceSupport/MDR1901VC1T/startup/arm/system_MDR1901VC1T.c" attr="config"/>
        <!-- header file-->
        <file category="header" name="Libraries/CMSIS/CM3/DeviceSupport/MDR1901VC1T/startup/arm/system_MDR1901VC1T.h" attr="config"/>
        <!-- header file-->
        <file category="header" name="Libraries/CMSIS/CM3/CoreSupport/core_cm3.h"/>
        <!-- header file-->
        <file category="header" name="Config/MDR32F9Qx_config.h" attr="config"/>
      </files>
    </component>    
    
    <component Cclass="Device" Cgroup="Startup" Cversion="1.5" condition="CON_MDR1986BE1T">
      <description>System Startup for MDR1986BE1T device series</description>
      <files>
        <!-- startup files -->
        <file category="source" name="Libraries/CMSIS/CM1/DeviceSupport/MDR1986VE1T/startup/arm/startup_MDR1986VE1T.s" attr="config"/>
        <!-- system file -->      
        <file category="source" name="Libraries/CMSIS/CM1/DeviceSupport/MDR1986VE1T/startup/arm/system_MDR1986VE1T.c" attr="config"/>
        <!-- header file-->
        <file category="header" name="Libraries/CMSIS/CM1/DeviceSupport/MDR1986VE1T/startup/arm/system_MDR1986VE1T.h" attr="config"/>
        <!-- header file-->
        <file category="header" name="Libraries/CMSIS/CM1/CoreSupport/core_cm1.h"/>
        <!-- system file -->
        <!-- header file-->
        <file category="header" name="Config/MDR32F9Qx_config.h" attr="config"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Startup" Cversion="1.5" condition="CON_MDR1986BE3T">
      <description>System Startup for MDR1986BE3T device series</description>
      <files>
        <!-- startup files -->
        <file category="source" name="Libraries/CMSIS/CM1/DeviceSupport/MDR1986VE3/startup/arm/startup_MDR1986VE3.s" attr="config"/>
        <!-- system file -->      
        <file category="source" name="Libraries/CMSIS/CM1/DeviceSupport/MDR1986VE3/startup/arm/system_MDR1986VE3.c" attr="config"/>
        <!-- header file-->
        <file category="header" name="Libraries/CMSIS/CM1/DeviceSupport/MDR1986VE3/startup/arm/system_MDR1986VE3.h" attr="config"/>
        <!-- header file-->
        <file category="header" name="Libraries/CMSIS/CM1/CoreSupport/core_cm1.h"/>
        <!-- header file-->
        <file category="header" name="Config/MDR32F9Qx_config.h" attr="config"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Startup" Cversion="1.5" condition="CON_MDR1986BE4">
      <description>System Startup for MDR1986BE4 device series</description>
      <files>
        <!-- startup files -->
        <file category="source" name="Libraries/CMSIS/CM0/DeviceSupport/MDR1986BE4/startup/arm/startup_MDR1986BE4.s" attr="config"/>
        <!-- system file -->      
        <file category="source" name="Libraries/CMSIS/CM0/DeviceSupport/MDR1986BE4/startup/arm/system_MDR1986BE4.c" attr="config"/>
        <!-- header file-->
        <file category="header" name="Libraries/CMSIS/CM0/DeviceSupport/MDR1986BE4/startup/arm/system_MDR1986BE4.h" attr="config"/>
        <!-- header file-->
        <file category="header" name="Libraries/CMSIS/CM0/CoreSupport/core_cm0.h"/>
        <!-- header file-->
        <file category="header" name="Config/MDR32F9Qx_config.h" attr="config"/>
      </files>
    </component>
            
