r00n4/docs_source/ARM/Milandr/Eval_1968BE92Q/MDR1986BExx_prj_exaples/1.5.3/MDR1986BEx.pdsc
    <!-- DMA  Driver -->
    <component Cclass="Drivers" Cgroup="DMA" Cversion="1.5" condition="CON_MDR1986BE4">
      <description>DMA driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_dma.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_dma.c"/>
      </files>
    </component>
    
    <!-- EEPROM  Driver -->
    <component Cclass="Drivers" Cgroup="EEPROM" Cversion="1.5" condition="CON_MDR1986BE4">
      <description>EEPROM driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_eeprom.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_eeprom.c"/>
      </files>
    </component>
    
    <!-- IWDG Driver -->
    <component Cclass="Drivers" Cgroup="IWDG" Cversion="1.5" condition="CON_MDR1986BE4">
      <description>IWDG driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_iwdg.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_iwdg.c"/>
      </files>
    </component>
    
    <!-- PORT  Driver -->
    <component Cclass="Drivers" Cgroup="PORT" Cversion="1.5" condition="CON_MDR1986BE4">
      <description>PORT driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_port.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_port.c"/>
      </files>
    </component>
    
    <!-- POWER  Driver -->
    <component Cclass="Drivers" Cgroup="POWER" Cversion="1.5" condition="CON_MDR1986BE4">
      <description>POWER driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_power.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_power.c"/>
      </files>
    </component>
    
    <!-- RST_CLK  Driver -->
    <component Cclass="Drivers" Cgroup="RST_CLK" Cversion="1.5" condition="CON_MDR1986BE4">
      <description>RST_CLK driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_rst_clk.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_rst_clk.c"/>
      </files>
    </component>
    
    <!-- SSP Driver -->
    <component Cclass="Drivers" Cgroup="SSP" Cversion="1.5" condition="CON_MDR1986BE4">
      <description>SSP driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_ssp.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_ssp.c"/>
      </files>
    </component>
    
    <!-- TIMER Driver -->
    <component Cclass="Drivers" Cgroup="TIMER" Cversion="1.5" condition="CON_MDR1986BE4">
      <description>TIMER driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_timer.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_timer.c"/>
      </files>
    </component>
    
    <!-- UART Driver -->
    <component Cclass="Drivers" Cgroup="UART" Cversion="1.5" condition="CON_MDR1986BE4">
      <description>UART driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_uart.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_uart.c"/>
      </files>
    </component>
    
    <!-- WWDG Driver -->
    <component Cclass="Drivers" Cgroup="WWDG" Cversion="1.5" condition="CON_MDR1986BE4">
      <description>WWDG driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_wwdg.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_wwdg.c"/>
      </files>
    </component>
    
    <!-- SDIO Driver -->
    <component Cclass="Drivers" Cgroup="SDIO" Cversion="1.5" condition="CON_MDR1901VC1">
      <description>WWDG driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_sdio.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_sdio.c"/>
      </files>
    </component>

    <!-- DSP Driver -->
    <component Cclass="Drivers" Cgroup="DSP" Cversion="1.5" condition="CON_MDR1901VC1">
      <description>WWDG driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_dsp.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_dsp.c"/>
      </files>
    </component>

  </components>
</package>